---
kind: property
id: P:Autodesk.Revit.DB.BasePoint.Position
source: html/1e5f8f39-9603-13bd-75ac-963eae3712eb.htm
---
# Autodesk.Revit.DB.BasePoint.Position Property

Position of the BasePoint.

## Syntax (C#)
```csharp
public XYZ Position { get; }
```